In [1]:
import pandas as pd
import numpy as np

## Lọc dữ liệu

In [2]:
#Tạo DataFrame với 6 hàng (tên, điểm, lớp) và lọc các học sinh có điểm >= 8.5
df = pd.DataFrame({
    "Name": ["Nam", "Tom", "Lucy", "Anh", "Julia", "Rose"],
    "Score": [10, 9, 8, 10, 5, 3],
    "Class": ["22T3", "21C1", "22T1", "22ST1", "23P1", "20K3"]
})
df.loc[df['Score']>8.5]

  Name  Score  Class
0  Nam     10   22T3
1  Tom      9   21C1
3  Anh     10  22ST1

## Xử lý giá trị thiếu

In [3]:
#Tạo DataFrame với 5 hàng, 3 cột (tên, tuổi, điểm), thêm 3 giá trị NaN ngẫu nhiên
df_1 = pd.DataFrame({
    "name": ["nam", "tâm", "hải", "dũng", "an"],
    "age": [20, 25, 30, 35, 40],
    "score": [3, 5, 10, 4, 8]
})
nan_indices = np.random.choice(df_1.index,size=3,replace=False)
df_1.loc[nan_indices, "score"] = np.nan

In [4]:
#Thay NaN bằng giá trị trung bình của cột hoặc xóa hàng chứa NaN
df_1.loc[nan_indices, "score"] = np.nanmean(df_1['score'],axis=0)

## Chuẩn hóa chuỗi

In [5]:
#Tạo cột 'tên' với các giá trị có khoảng trắng thừa (ví dụ: "An  ", "  Bình")
df_1['Tên'] = df_1['name'] + " "

In [6]:
df_1

   name  age  score    Tên
0   nam   20    6.0   nam
1   tâm   25    6.0   tâm
2   hải   30    6.0   hải
3  dũng   35    4.0  dũng
4    an   40    8.0    an

In [7]:
#Loại bỏ khoảng trắng thừa và viết hoa chữ cái đầu
df_1['Tên'] = df_1['Tên'].str.strip()
df_1['Tên'] = df_1['Tên'].str.capitalize()

In [8]:
df_1

   name  age  score   Tên
0   nam   20    6.0   Nam
1   tâm   25    6.0   Tâm
2   hải   30    6.0   Hải
3  dũng   35    4.0  Dũng
4    an   40    8.0    An

## Thêm cột điều kiện

In [9]:
df["Status"] = ['Pass' if x >= 8 else 'Fail' for x in df['Score']]

## Xử lý định dạng sai

In [10]:
#Tạo cột 'ngày sinh' với định dạng không đồng nhất (ví dụ: "2023-01-01", "01/02/2023")
df['BirthDay'] = ["2003-01-01", "01/02/2023", "2004-28-08", "28/09/2004", "2005-05-05", "24/04/2004"]

In [11]:
df

    Name  Score  Class Status    BirthDay
0    Nam     10   22T3   Pass  2003-01-01
1    Tom      9   21C1   Pass  01/02/2023
2   Lucy      8   22T1   Pass  2004-28-08
3    Anh     10  22ST1   Pass  28/09/2004
4  Julia      5   23P1   Fail  2005-05-05
5   Rose      3   20K3   Fail  24/04/2004

In [ ]:
#Chuẩn hóa thành định dạng datetime
df['BirthDay'] = pd.to_datetime(df['BirthDay'], errors='coerce', dayfirst=True)

In [13]:
df

    Name  Score  Class Status   BirthDay
0    Nam     10   22T3   Pass 2003-01-01
1    Tom      9   21C1   Pass        NaT
2   Lucy      8   22T1   Pass 2004-08-28
3    Anh     10  22ST1   Pass        NaT
4  Julia      5   23P1   Fail 2005-05-05
5   Rose      3   20K3   Fail        NaT